In [1]:
import pandas as pd

In [3]:
path = 'C:\\Users\\FIC\\Documents\\Rafael-Dias-Python\\arquivos\\'
file = 'bank-full.xlsx'

dados = pd.read_excel(path + file, sheet_name='Sheet 1 - bank-full')

In [4]:
dados

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45209,57,blue-collar,married,secondary,no,668,no,no,telephone,17,nov,508,4,-1,0,unknown
45210,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other
45211,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other
45212,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other
45213,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other

In [5]:
media = dados['balance'].mean()

# Ajustando casas decimais
#round(media, 2)

round(media, 0)

1362.0

In [6]:
round(dados[['balance','duration']].mean(),0)

balance     1362.0
duration     258.0
dtype: float64

In [7]:
dados.balance.sum()

61598595

In [8]:
dados[['pdays','duration','balance']].sum()

pdays        1817948
duration    11672894
balance     61598595
dtype: int64

In [9]:
dados.job.unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [10]:
##elementos unicos
dados.job.nunique()

12

In [11]:
##dados duplicados em uma coluna
dados.job.duplicated().sum()

45202

In [12]:
##dados duplicados em uma coluna (verifica se tem registro duplicado no dataframe)
dados.duplicated().sum()

3

In [13]:
dados.loc[dados.duplicated()==True]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
45211,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other
45212,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other
45213,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other

In [14]:
# Remover dados duplicados
#Paracriar um novo dataframe sem os dados duplicados, utilizamos a funÃ§Ã£o pd drop_duplicated

dados2=dados.drop_duplicates()

## Dados nulos ou faltantes

Dados faltantes ou nulos podem enviesar as anÃ¡lises, por isso Ã© sempre importante eliminÃ¡ los ou substituÃ­ los (de acordo com o contexto de anÃ¡lise)

Uma maneira de saber a quantidade de dados faltantes Ã© utilizando a funÃ§Ã£o pd isna ou pd isnull com a funÃ§Ã£o pd sum

In [16]:
dados.isnull()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45209,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45210,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45211,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45212,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45213,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [20]:
dados.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
dtype: int64

In [22]:
#Para criar um novo dataframe sem os dados faltantes ou nulos, utilizamos a funÃ§Ã£o pd.dropna()
dados3 = dados.dropna()

In [23]:
#Quando for necessÃ¡rio substituir os dados faltantes por um novo valor, podemos usar a funÃ§Ã£o pd fillna

dados4 = dados.fillna('desconhecido')

## Unindo amostras de dados

Com o Pandas, temos alguns mÃ©todos para unir dados de datasets distintos, dentre os quais podemos citar
- concat
    - funÃ§Ã£o que une os datasets ao longo de um eixo
- merge
    - mÃ©todo que combina um ou mais datasets baseado em uma coluna em comum

In [3]:
import pandas as pd

In [4]:
dados= {
    'ID':['1', '2', '3', '4', '5'],
    'nome':['Ana', 'Barbara', 'Douglas', 'Lorenzo', 'Enzo'],
    'sobrenome':['Silva', 'MourÃ£o', 'Souza', 'Lopes','Mendes']
}

In [5]:
df1 = pd.DataFrame(dados, columns=['ID', 'nome','sobrenome'])

In [6]:
df1

  ID     nome sobrenome
0  1      Ana     Silva
1  2  Barbara    MourÃ£o
2  3  Douglas     Souza
3  4  Lorenzo     Lopes
4  5     Enzo    Mendes

In [7]:
dados2= {
    'ID':['6', '7', '8', '9', '10'],
    'nome':['Eder', 'Lucas', 'Joana', 'Paulo', 'Bete'],
    'sobrenome':['Junqueira', 'Tarrou', 'Liza', 'Oshio','Yuho']
}

In [8]:
df2 = pd.DataFrame(dados2, columns=['ID', 'nome','sobrenome'])

In [9]:
df2

   ID   nome  sobrenome
0   6   Eder  Junqueira
1   7  Lucas     Tarrou
2   8  Joana       Liza
3   9  Paulo      Oshio
4  10   Bete       Yuho

In [19]:
notas= {
    'ID':['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
    'notas_id':[51, 55, 15, 61, 84, 96, 100, 0, 78, 12],
}

In [20]:
df_notas = pd.DataFrame(notas, columns=['ID', 'notas_id'])

In [21]:
df_notas

   ID  notas_id
0   1        51
1   2        55
2   3        15
3   4        61
4   5        84
5   6        96
6   7       100
7   8         0
8   9        78
9  10        12

In [24]:
## empilhar od dataframes 1 e 2 
df_1_2 = pd.concat([df1,df2], ignore_index=True)

df_1_2

   ID     nome  sobrenome
0   1      Ana      Silva
1   2  Barbara     MourÃ£o
2   3  Douglas      Souza
3   4  Lorenzo      Lopes
4   5     Enzo     Mendes
5   6     Eder  Junqueira
6   7    Lucas     Tarrou
7   8    Joana       Liza
8   9    Paulo      Oshio
9  10     Bete       Yuho

In [25]:
## Realizar a associaÃ§Ã£o 

df_final = pd.merge(df_1_2,df_notas,on='ID',how='left')
df_final

   ID     nome  sobrenome  notas_id
0   1      Ana      Silva        51
1   2  Barbara     MourÃ£o        55
2   3  Douglas      Souza        15
3   4  Lorenzo      Lopes        61
4   5     Enzo     Mendes        84
5   6     Eder  Junqueira        96
6   7    Lucas     Tarrou       100
7   8    Joana       Liza         0
8   9    Paulo      Oshio        78
9  10     Bete       Yuho        12